{
  "title": "General Liability Group",
  "slug": "general-liability",
  "location": "Philadelphia, PA 19103",
  "jobType": "Full-time",
  "salary": "$90,000 - $125,000 per year",
  "introduction": [
    "Swartz Campbell LLC is a regional insurance defense firm providing comprehensive legal services and counseling to insurers and self-insureds in complex civil matters. With a legacy spanning over a century, the firm has built a reputation based on its unwavering commitment to clients, demonstrated through aggressive advocacy and expert legal guidance across a wide spectrum of litigation areas.",
    "We are currently seeking talented, motivated legal professionals to join our team in our Philadelphia and Pittsburgh offices. We have immediate openings for a full-time litigation Associate in the Professional Liability Group and a full-time litigation Associate in the General Liability Group. We offer meaningful hands-on experience, a collaborative team environment, and opportunities for professional growth."
  ],
  "description": "The General Liability Group is also seeking an experienced attorney to join our practice. The group represents businesses, property owners, motor vehicle operators/owners and insurance carriers in defending against claims of bodily injury, property damage, and economic loss arising from alleged negligence and other tort claims in New Jersey and Southeastern Pennsylvania.",
  "idealCandidate": "The ideal candidate will have 3-5 years experience defending clients in a variety of general liability matters. However, we are also open to training a recent bar recipient with some internship/clerkship experience in a relevant field.",
  "requirements": [
    "Juris Doctorate from an ABA accredited law school",
    "Pennsylvania bar required",
    "Dual bar in New Jersey preferred",
    "3-5 years experience (or recent bar recipient with internship/clerkship experience)"
  ],
  "responsibilities": [
    "Independent handling of a diverse range of general liability matters at all phases of litigation, from inception through trial—including pleadings, discovery, motion practice, depositions, and other court appearances",
    "Conducting legal research and drafting legal memoranda, motions, briefs and other litigation documents",
    "Communicating effectively with clients and insurance carriers, and providing regular case updates and strategic counsel",
    "Collaborating with team members and contributing to the overall success of the practice group"
  ],
  "benefits": [
    "401(k)",
    "401(k) matching",
    "Health insurance",
    "Dental insurance",
    "Vision insurance",
    "Life insurance",
    "Flexible spending account",
    "Paid time off",
    "Retirement plan"
  ],
  "workArrangement": "In person- preferred, but a hybrid arrangement will be considered depending on the candidate and their experience",
  "eeoc": "Swartz Campbell provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
  "contactEmail": "attycareers@swartzcampbell.com"
}
