{
  "title": "Professional Liability Group",
  "slug": "professional-liability",
  "location": "Philadelphia, PA 19103",
  "jobType": "Full-time",
  "salary": "$90,000 - $125,000 per year",
  "introduction": [
    "Swartz Campbell LLC is a regional insurance defense firm providing comprehensive legal services and counseling to insurers and self-insureds in complex civil matters. With a legacy spanning over a century, the firm has built a reputation based on its unwavering commitment to clients, demonstrated through aggressive advocacy and expert legal guidance across a wide spectrum of litigation areas.",
    "We are currently seeking talented, motivated legal professionals to join our team in our Philadelphia and Pittsburgh offices. We have immediate openings for a full-time litigation Associate in the Professional Liability Group and a full-time litigation Associate in the General Liability Group. We offer meaningful hands-on experience, a collaborative team environment, and opportunities for professional growth."
  ],
  "description": "The Professional Liability Group focuses on the defense of actions and proceedings against lawyers and other professionals. Attorneys manage, monitor, and participate in collateral proceedings involving criminal investigations and prosecutions, administrative proceedings, and professional licensing proceedings which may impact the claim litigation. The group also defends residential construction defect cases in addition to commercial construction matters in the defense of architects and engineers.",
  "requirements": [
    "Juris Doctorate from an ABA accredited law school",
    "Licensed to practice law",
    "Philadelphia office: Dual-licensed in Pennsylvania and either New Jersey or New York, or licensed only in Pennsylvania but eligible to waive into New Jersey or New York",
    "Pittsburgh office: Dual-licensed in Pennsylvania and West Virginia, or licensed only in Pennsylvania but eligible to waive into West Virginia",
    "Highly motivated self-starter with strong writing, organizational, and time management skills",
    "Ability to work independently and collaboratively"
  ],
  "experience": [
    "Handling an active litigation caseload",
    "Writing motions, briefs, and status reports",
    "Conducting legal research",
    "Attending depositions",
    "Speaking with claims adjusters"
  ],
  "benefits": [
    "401(k)",
    "401(k) matching",
    "Health insurance",
    "Dental insurance",
    "Vision insurance",
    "Life insurance",
    "Flexible spending account",
    "Paid time off",
    "Retirement plan"
  ],
  "workArrangement": "In person- preferred, but a hybrid arrangement will be considered depending on the candidate and their experience",
  "eeoc": "Swartz Campbell provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
  "contactEmail": "attycareers@swartzcampbell.com"
}
