[
  "There is no matter I would not confidently place with you and Swartz Campbell for handling. I look forward to many more years of partnering in the future.",
  "I wanted to thank you and your staff at Swartz Campbell for the fine services you have provided over our many years together… Your services have always been top rate and I credit you for achieving consistently favorable outcomes.",
  "Not only did they represent my firm and me in the best traditions of the profession, they truly made me feel like I wasn't just another client. I have been practicing for 29 years and I only wish I could be as service oriented as they were to me. They not only defended my position, they truly believed in me as another professional.",
  "Your concern for your client's welfare is commendable. Thank you for not only the excellent job that you did but your professionalism… Thank you.",
  "I would not hesitate to assign the defense of any insured to you whether the claim arose in Pennsylvania or any other state… One of your greatest strengths is in negotiating settlements where we have received the benefit of numerous savings. Our trust in you extends beyond the realm of professional liability.",
  "Thank you for giving me back my life and peace of mind.",
  "No matter what type of litigation we throw your way, whether it be a professional liability or non-professional liability, you always come up with a quality plan of action.",
  "Get outta town! You guys are geniuses.",
  "Saying THANK YOU seems so inadequate… I really do feel I am in your debt for the excellent work you did on this case… I was pleased with the results, but I wanted to go on record noting your manner in dealing with laymen like me in addition to your legal abilities. It is a very impressive and valuable combination for a professional to possess… I owe you! THANKS AGAIN for your time and effort.",
  "I will be eternally grateful to all of you for having rescued me from potential disaster and for treating me with empathy and dignity always… My best wishes to you all for success and happiness…",
  "You most aptly and successfully represented and defended me, and the firm. I have not forgotten how well you handled a most disruptive matter, and what a comfort you were on a very personal level.",
  "Thank you for your excellent and competent representation, including your thorough legal and factual analyses in regards to this complex case.",
  "Your efforts clearly took a near disaster and turned it into the closest thing to a victory that [we] could have hoped for.",
  "We greatly value the ease of doing business with you and your firm. I can't recall a time where we have ever had a dispute over your firm's rates or any charges for legal services. Each case assignment is treated as a partnership to advance the interests of our insureds.",
  "I want to personally thank you for your representation in this matter. I could not have had finer counsel and I certainly cannot quarrel with the result. Thank you once again.",
  "I don’t think I could have felt more confident that I had the best counsel and support in this matter…",
  "Thank you for your excellent services in representing our firm.",
  "This  is  not  just  good  news,  it  is great news. I want to thank you for all of your efforts and expertise in handling this claim. I am sure our result would not have been the same if you had not taken this case over.",
  "As usual, you are the best."
]
