{
  "name": "Allison Texter",
  "title": "Partner",
  "practiceAreas": ["Asbestos", "Insurance Litigation", "General Liability"],
  "image": "images/attorneys/Texter-Allison-023-683x1024.jpg",
  "email": "",
  "phone": "",
  "office": "Wilmington",
   "barAdmissions": [
    "1996 Delaware",
    "2024 Pennsylvania"
  ],
  "courtAdmissions": [
    "1997 United States District Court of Delaware",
    "1997 United States Court of Appeals- Third Circuit"
  ],
  "education": [
    "1992 Columbia College of Columbia University, New York, NY - B.A. in Economics",
    "1996 Widener University School of Law, Philadelphia, PA - J.D."
  ],
  "bio": "Allison Texter is a partner and equity member in the firm’s Wilmington office, concentrating her practice on products liability, insurance defense, and general liability matters. She has represented corporations, insureds, and individuals in a variety of matters, including asbestos litigation, pharmaceutical claims, medical device defects, construction defects, premises liability, business licensing matters, and automotive and trucking accidents. She is an experienced trial attorney as well as a trained mediator by the Superior Court of the State of Delaware. Ms. Texter graduated from Columbia College of Columbia University with a B.A. in Economics. She received her J.D. from the Widener University School of Law, where she was a member of the Moe Levine Trial Advocacy Honor Society and the Moot Court Honor Society. Prior to joining Swartz Campbell, she served as a Deputy Attorney General for the Delaware Department of Justice, prosecuting serious felony matters including homicides and sex offenses. During her tenure in the Criminal Division, Mr. Texter was appointed Assistant Unit Head of the Misdemeanor Trial Unit and Unit Head of the Sex Crimes Unit. Later, she worked in the DOV Civil Division defending state agencies in civil litigation. This unique combination of high-level criminal prosecution and civil defense experience provides her with a comprehensive perspective and formidable skill set in handling sophisticated legal challenges."
}
