{
  "name": "Candidus K. Dougherty",
  "title": "Partner",
  "practiceAreas": ["Civil Litigation & Dispute Resolution"],
  "image": "images/attorneys/Candidus-K-Dougherty.jpg",
  "email": "cdougherty@swartzcampbell.com",
  "phone": "(555) 123-4590",
  "office": "New York",
  "credentials": [
    "J.D., University of Pennsylvania Law School, 1996",
    "B.A., Political Science, Georgetown University, 1993",
    "Licensed in Pennsylvania, New Jersey, and New York",
    "Member, American College of Trial Lawyers",
    "Board Certified in Civil Trial Law",
    "Named 'Super Lawyer' by Pennsylvania Super Lawyers (2010-2025)"
  ],
  "bio": "Candidus K. Dougherty is a highly accomplished civil litigator with nearly 30 years of experience in complex commercial litigation, professional liability defense, and alternative dispute resolution. As a member of the American College of Trial Lawyers and board certified in civil trial law, Dougherty has established himself as one of the premier trial attorneys in the region. His extensive litigation experience encompasses breach of contract disputes, business torts, professional malpractice defense, and employment litigation. Dougherty has successfully tried numerous high-exposure cases to verdict and has obtained favorable outcomes for clients in some of the most challenging and complex litigation matters. He is also an accomplished mediator and arbitrator, helping parties resolve disputes efficiently outside of court. Dougherty's approach to litigation combines thorough case preparation with strategic thinking and persuasive advocacy. He has been consistently recognized as a Super Lawyer for over fifteen years and is frequently called upon by other attorneys to handle their most challenging cases. Dougherty's practice includes representing corporations, professional service firms, and individuals in bet-the-company litigation. He is known for his ability to distill complex factual and legal issues into compelling narratives for judges and juries. His reputation for excellence has made him a trusted advisor to clients facing their most significant legal challenges."
}
