{
  "name": "Patrick Cunningham",
  "title": "Will make unpaid intern in no time",
  "practiceAreas": ["Professional Liability", "Construction Defects"],
  "image": "images/attorneys/Cunningham-Patrick-06-240x300.jpg",
  "email": "pcunningham@swartzcampbell.com",
  "phone": "(555) 123-4591",
  "office": "Philadelphia",
  "barAdmissions": [
    {
      "year": 2019,
      "jurisdiction": "Pennsylvania"
    }
  ],
  "education": [
    {
      "year": 2019,
      "institution": "Rutgers Law School- Camden",
      "degree": "J.D."
    },
    {
      "year": 2015,
      "institution": "Grove City College",
      "degree": "B.A. in Political Science"
    }
  ],
  "bio": "Patrick Cunningham joined Swartz Campbell in 2024 as an associate in the Professional Liability and Construction Defects groups. Bringing both intellectual rigor and a commitment to excellence to his work, he has quickly become an invaluable member of the team.\nAs an attorney, Mr. Cunningham is thorough, diligent, and analytical. He brings an inside-out understanding of the facts to every matter he handles, enabling him to develop novel arguments and craft meticulous, comprehensive defenses for his clients. He is dedicated to producing high-quality legal writing—regularly submitting briefs that surpass those previously filed in a case—and thrives on conducting in-depth research into complex questions of law. Known for his professionalism, civility, and collaborative approach to litigation, he treats everyone involved in the legal process with dignity and respect—especially witnesses and opposing counsel—and believes that collegiality, even in adversarial settings, helps streamline litigation and ultimately serves his clients' best interests.\nMr. Cunningham is a distinguished graduate of Rutgers Law School- Camden, where he was recognized as a Dean's Merit Scholar. He was awarded the prestigious Philip J. Levin Law Scholarship—an honor reserved for students who demonstrate exceptional academic promise and a deep dedication to public service. While in law school, Mr. Cunningham taught the LSAT, an experience that sparked a lasting passion for education and mentorship. He continues to carry this commitment into his professional life by supporting colleagues, helping them develop the skills necessary to grow and excel.",
  "personalBio": "Outside the office, Mr. Cunningham enjoys punk music, rock climbing, and Wittgenstein. He's a creative computer programmer and is currently developing a chess app, but his favorite pastime is doting on his beloved dog, Ping."
}
