{
  "title": "The Women of Swartz Campbell",
  "paragraphs": [
    "According to the National Association for Law Placement, female attorneys are less likely to make partner than their male counterparts. In 2023, just 28% of partners were women. At Swartz Campbell, we are proud to stand apart in this regard, with equal representation among partners in our Philadelphia Office and a majority in our Mount Laurel, New Jersey office. This achievement is not merely a number, but a testament to our intentional and proactive efforts to build a workplace where talent is recognized and rewarded regardless of gender.",
    "Swartz Campbell firmly believes that fostering equality is not just a moral imperative, but ultimately contributes to a more productive and prosperous business. Our Management Committee, also boasting a female majority, is proof of this concept. The three esteemed managing partners—Candidus Dougherty, Pamela Maginnis, and Allison Texter—bring a wealth of practical experience and legal expertise to their roles, and their leadership has been instrumental to our clients' and the firm's success. Additionally, our two largest practice groups—Professional Liability and Toxic Torts—are led by women—Candidus Dougherty and Pamlea Maginnis, respectively. Moreover, women constitute the majority of our associates and support staff, further underscoring our dedication to recruiting, nurturing, and promoting talented women at every level.",
    "Beyond representation, Swartz Campbell prioritizes retaining the women who choose to build their careers with us. Many of our female employees have been at the firm for decades—some for their entire legal careers. This speaks not only to the strength of our culture, but our commitment to creating an environment where women can achieve long-term professional growth through tangible opportunities for advancement, recognition for their contributions, and a meaningful, hands-on role in the firm's ongoing success. At Swartz Campbell, we are honored that so many exceptional women have entrusted us with their careers and will continue to celebrate their incredible work."
  ],
  "image": "images/content/gender-diversity.jpg"
}
